 #define EVR_DEBUG 
/***************************************************************************************************
|* drvMrfEr.c -- EPICS Driver Support Module for the Micro-Research Finland (MRF)
|*               Series 200 Event Receiver Card
|*
|*--------------------------------------------------------------------------------------------------
|* Authors:  John Winans (APS)
|*           Timo Korhonen (PSI)
|*           Babak Kalantari (PSI)
|*           Eric Bjorklund (LANSCE)
|*
|* Date:     29 January 2006
|*
|*--------------------------------------------------------------------------------------------------
|* MODIFICATION HISTORY:
|* 21 Jul 1993  J.Winans        Original APS Event system device support module.
|* 29 Jan 2006  E.Bjorklund     Split driver and device support into separate software modules.
|*                              Make code OS-independent for EPICS Release 3.14.
|*                              Add support for data stream
|* 03 April 2006 D.Kotturi      Add support for PMC-EVR
|* 12 April 2006 D.Kotturi      Merge PMC version of MrfErRegs, into existing MrfErRegs, changing
|*                              names in PMC code to match existing MrfErRegs
|* 28 Nov 2006 D. Kotturi       Moving all needed config routines from drvPmc
|*                              into here
|*
|*--------------------------------------------------------------------------------------------------
|* MODULE DESCRIPTION:
|*

#include <epicsStdlib.h>        /* EPICS Standard C library support routines                      */
#include <epicsStdio.h>         /* EPICS Standard C I/O support routines                          */
#include <epicsTypes.h>         /* EPICS Architecture-independent type definitions                */
#include <epicsInterrupt.h>     /* EPICS Interrupt context support routines                       */
#include <epicsMutex.h>         /* EPICS Mutex support library                                    */
#include <epicsThread.h>        /* EPICS Thread support library                                   */
#include <epicsExit.h>          /* EPICS Exit support routines                                    */

#include <devLib.h>             /* EPICS Device hardware addressing support library               */
#include <drvSup.h>             /* EPICS Driver support definitions                               */
#include <ellLib.h>             /* EPICS Linked list support library                              */
#include <errlog.h>             /* EPICS Error logging support library                            */
#include <registryFunction.h>   /* EPICS Registry support library                                 */
#include <iocsh.h>              /* EPICS iocsh support library                                    */
#include <epicsExport.h>        /* EPICS Symbol exporting macro definitions                       */
#ifdef __rtems__
#include <rtems/pci.h>          /* for PCI_VENDOR_ID_PLX */
#include <rtems/irq.h>          /* for rtems_irq_connect_data, rtems_irq_hdl_param */
#endif
#include <mrfVme64x.h>          /* VME-64X CR/CSR routines and definitions (with MRF extensions)  */
#include <basicIoOps.h>         /* for out_le16, in_le16 */
#include "devLibPMC.h"          /* for epicsFindDevice */
#include "drvMrfEr.h"           /* MRF Series 200 Event Receiver driver support layer interface   */

/**************************************************************************************************/
/*  Debug Interest Level                                                                          */
/**************************************************************************************************/

#ifdef DEBUG_PRINT
int drvMrfErFlag = DP_ERROR;            /* Interest level can be set from the command shell       */
#endif

/**************************************************************************************************/
/*                            Event Receiver Hardware Definitions                                 */
/*                                                                                                */

/**************************************************************************************************/
/*  Series 200 VME and PMC Event Receiver Register Map                                                        
    BIG ENDIAN! Yes, even for PMC */
/**************************************************************************************************/

typedef struct MrfErRegs 
{
    epicsUInt16  Control;               /* 000: Control and Status Register                       */

   /*---------------------
    * Event Mapping RAM
    */
    epicsUInt16  EventRamAddr;          /* 002: Mapping RAM Address Register (8-bit)              */
    epicsUInt16  EventRamData;          /* 004: Mapping RAM Data Register                         */

    epicsUInt16  OutputPulseEnables;    /* 006: Output Pulse Enable Register                      */
    epicsUInt16  OutputLevelEnables;    /* 008: Output Level Enable Register                      */
    epicsUInt16  TriggerEventEnables;   /* 00A: Trigger Pulse Enable Register                     */

   /*---------------------
    * Timestamp registers
    */
    epicsUInt16  EventCounterLo;        /* 00C: Timestamp Event Counter (LSW)                     */
    epicsUInt16  EventCounterHi;        /* 00E: Timestamp Event Counter (MSW)                     */
    epicsUInt16  TimeStampLo;           /* 010: Timestamp Latch (LSW)                             */
    epicsUInt16  TimeStampHi;           /* 012: Timestamp Latch (MSW)                             */

   /*---------------------
    * Series 100 Compatible Event FIFO Registers
    */
    epicsUInt16  EventFifo;             /* 014: LSB = event #, MSB = LSB of time stamp counter    */
    epicsUInt16  EventTimeHi;           /* 016: Bits 23-8 of the time stamp counter               */

   /*---------------------
    * Delayed Pulse (DG) and Output Pulse (OTP) Enable and Select Registers
    */
    epicsUInt16  DelayPulseEnables;     /* 018: Delayed Pulse Enable Register                     */
    epicsUInt16  DelayPulseSelect;      /* 01A: Delayed Pulse Select Register                     */

   /*---------------------
    * Series 100 Compatible 16-bit Delayed Pulse (DG) Delay and Width Registers
    * Also used with the delayed interrupt feature.
    */
    epicsUInt16  PulseDelay;            /* 01C: Delayed Pulse Delay Register (Multiplexed)        */
    epicsUInt16  PulseWidth;            /* 01E: Delayed/Output Pulse Width Register (Multiplexed) */

   /*---------------------
    * Interrupt Control Registers
    */
    epicsUInt16  IrqVector;             /* 020: if VME_EVR, Interrupt Vector Register, if PMC_EVR, Reserved*/
    epicsUInt16  IrqEnables;            /* 022: Interrupt Enable Register                         */

   /*---------------------
    * Distributed Data Bus Registers
    */
    epicsUInt16  DBusEnables;           /* 024: Distributed Bus Enable Register                   */
    epicsUInt16  DBusData;              /* 026: Distributed Bus Data Register (Read Only)         */

   /*---------------------
    * Prescalers
    */
    epicsUInt16  DelayPrescaler;        /* 028: Delayed Pulse (DG) Clock Prescaler (Multiplexed)  */
    epicsUInt16  EventCounterPrescaler; /* 02A: Event Counter Clock Prescaler                     */

    epicsUInt16  Resvd1;                /* 02C: Reserved                                          */

    /*---------------------
     * FPGA Firmware Version
     */
    epicsUInt16  FPGAVersion;           /* 02E: FPGA Firmware Version Number (Read Only)          */

    epicsUInt16  Resvd3;                /* 030: Reserved                                          */
    epicsUInt16  Resvd4;                /* 032: Reserved                                          */
    epicsUInt16  Resvd5;                /* 034: Reserved                                          */
    epicsUInt16  Resvd6;                /* 036: Reserved                                          */
    epicsUInt16  Resvd7;                /* 038: Reserved                                          */
    epicsUInt16  Resvd8;                /* 03A: Reserved                                          */
    epicsUInt16  Resvd9;                /* 03C: Reserved                                          */
    epicsUInt16  FP7Map;                /* 03E: Front Panel TTL 7/CML 3 Output Mapping Register   */

   /*---------------------
    * Front Panel Output Mapping Registers
    */
    epicsUInt16  FP0Map;                /* 040: Front Panel TTL 0 Output Mapping Register         */
    epicsUInt16  FP1Map;                /* 042: Front Panel TTL 1 Output Mapping Register         */
    epicsUInt16  FP2Map;                /* 044: Front Panel TTL 2 Output Mapping Register         */
    epicsUInt16  FP3Map;                /* 046: Front Panel TTL 3 Output Mapping Register         */
    epicsUInt16  FP4Map;                /* 048: Front Panel TTL 4/CML 0 Output Mapping Register   */
    epicsUInt16  FP5Map;                /* 04A: Front Panel TTL 5/CML 1 Output Mapping Register   */
    epicsUInt16  FP6Map;                /* 04C: Front Panel TTL 6/CML 2 Output Mapping Register   */

   /*---------------------
    * Timing and Timestamping Registers
    */
    epicsUInt16  uSecDiv;               /* 04E: Divider to get from event clock to ~ 1 MHz        */
    epicsUInt16  ExtEventCode;          /* 050: External Event Code Register                      */
    epicsUInt16  ClockControl;          /* 052: Event Clock Control Register                      */
    epicsUInt32  SecondsSR;             /* 054: Seconds Shift Register                            */
    epicsUInt32  TSSec;                 /* 058: Timestamp Latch Seconds Register                  */
    epicsUInt32  Resvd12;               /* 05C: Reserved                                          */
    epicsUInt32  EvFIFOSec;             /* 060: Event FIFO Seconds Register                       */
    epicsUInt32  EvFIFOEvCnt;           /* 064: Event FIFO Counter Register                       */

   /*---------------------
    * Output and Delay Pulse Extended Delay, Width, and Polarity Registers
    */
    epicsUInt32  OutputPol;             /* 068: Output Pulse (OTP) Polarity Register              */
    epicsUInt32  ExtDelay;              /* 06C: Extended 32-Bit Delay Register for OTP & DG Gates */
    epicsUInt32  ExtWidth;              /* 070: Extended 32-Bit Width Register (DG Only)          */

   /*---------------------
    * Front Panel Clock Pre-Scalers
    */
    epicsUInt16  Prescaler_0;           /* 074: Front panel clock 0 prescaler                     */
    epicsUInt16  Prescaler_1;           /* 076: Front panel clock 1 prescaler                     */
    epicsUInt16  Prescaler_2;           /* 078: Front panel clock 2 prescaler                     */

   /*---------------------
    * Data Buffer Control Register
    */
    epicsUInt16  DataBuffControl;       /* 07A: Data buffer control register                      */

   /*---------------------
    * Miscellaneous (RF Recovery, Delay Tuning, Reference Clock, etc.)
    */
    epicsUInt32  RFPattern;             /* 07C: RF Pattern register                               */
    epicsUInt32  FracDiv;               /* 080: Event Receiver Reference Clock                    */
    epicsUInt32  RfDelay;               /* 084: RF Delay Chip Setting                             */
    epicsUInt32  RxDelay;               /* 088: Recovered Event Clock Delay Chip Setting          */
    epicsUInt32  Resvd15;               /* 08C: Reserved                                          */
  
   /*---------------------
    * Universal I/O Output Mapping Registers
    */
    epicsUInt16  UN0Map;                /* 090: Front Panel TTL 0 Output Mapping Register         */
    epicsUInt16  UN1Map;                /* 092: Front Panel TTL 1 Output Mapping Register         */
    epicsUInt16  UN2Map;                /* 094: Front Panel TTL 2 Output Mapping Register         */
    epicsUInt16  UN3Map;                /* 096: Front Panel TTL 3 Output Mapping Register         */
    epicsUInt32  Resvd13;               /* 098: Reserved                                          */
    epicsUInt32  Resvd14;               /* 09C: Reserved                                          */

   /*---------------------
    * Data Buffer Area
    */
    epicsUInt32  Resvd16    [(0x800-0x0A0)/4];   /* 0A0-7FF: Reserved                             */
    epicsUInt32  DataBuffer [EVR_MAX_BUFFER/4];  /* 800-FFF: Data Buffer                          */

} MrfErRegs;

/**************************************************************************************************/
/*  Series 200 PMC Event Receiver Configuration Space Register Map                                 
    LITTLE ENDIAN. Yes, even though PMC's MrfErRegs space is BIG ENDIAN. */
/**************************************************************************************************/

typedef struct PmcErCfgRegs
{
  epicsUInt32 LAS0RR;                 /* 00h Local Address Space 0 Range */
  epicsUInt32 LAS1RR;                 /* 04h Local Address Space 1 Range */
  epicsUInt32 LAS2RR;                 /* 08h Local Address Space 2 Range */
  epicsUInt32 LAS3RR;                 /* 0Ch Local Address Space 3 Range */
  epicsUInt32 EROMRR;                 /* 10h Expansion ROM Range */
  epicsUInt32 LAS0BA;                 /* 14h Local Address Space 0 Local Base Address (Remap) */
  epicsUInt32 LAS1BA;                 /* 18h Local Address Space 1 Local Base Address (Remap) */
  epicsUInt32 LAS2BA;                 /* 1Ch Local Address Space 2 Local Base Address (Remap) */
  epicsUInt32 LAS3BA;                 /* 20h Local Address Space 3 Local Base Address (Remap) */
  epicsUInt32 EROMBA;                 /* 24h Expansion ROM Local Base Address (Remap) */
  epicsUInt32 LAS0BRD;                /* 28h Local Address Space 0 Bus Region Descriptor */
  epicsUInt32 LAS1BRD;                /* 2Ch Local Address Space 1 Bus Region Descriptor */
  epicsUInt32 LAS2BRD;                /* 30h Local Address Space 2 Bus Region Descriptor */
  epicsUInt32 LAS3BRD;                /* 34h Local Address Space 3 Bus Region Descriptor */
  epicsUInt32 EROMBRD;                /* 38h Expansion ROM Bus Region
Descriptor */
  epicsUInt32 CS0BASE;                /* 3Ch Chip Select 0 Base Address */
  epicsUInt32 CS1BASE;                /* 40h Chip Select 1 Base Address */
  epicsUInt32 CS2BASE;                /* 44h Chip Select 2 Base Address */
  epicsUInt32 CS3BASE;                /* 48h Chip Select 3 Base Address */
  epicsUInt16 INTCSR;                 /* 4Ch Interrupt Control/Status */
  epicsUInt16 PROT_AREA;              /* 4Eh Serial EEPROM Write-Protected Address Boundary */
  epicsUInt32 CNTRL;                  /* 50h PCI Target Response, Serial EEPROM, and Initialization Control */
  epicsUInt32 GPIOC;                  /* 54h General Purpose I/O Control */
  epicsUInt32 Pad[6];
  epicsUInt32 PMDATASEL;              /* 70h Hidden 1 Power Management Data Select */
  epicsUInt32 PMDATASCALE;            /* 74h Hidden 2 Power Management Data Scale */
} PmcErCfgRegs;

/**************************************************************************************************/
/*  Control/Status Register (0x000) Bit Assignments                                               */
/**************************************************************************************************/

/*---------------------
 * Control Fields
 */
#define EVR_CSR_RSRXVIO   0x0001        /* Write 1 to Reset Receive Violation Flag                */
#define EVR_CSR_RSDIRQ    0x0002        /* Write 1 to Reset the Delayed Interrupt Flag            */
#define EVR_CSR_RSFF      0x0004        /* Write 1 to Reset the FIFO Full Flag                    */
#define EVR_CSR_RSFIFO    0x0008        /* Write 1 to Reset the FIFO - not used                   */
#define EVR_CSR_RSADR     0x0010        /* Write 1 to Reset the Mapping RAM Address Register      */
