#define EG_DEBUG 
/***************************************************************************************************
|* drvMrfEg.c -- EPICS Driver Support Module for the Micro-Research Finland (MRF)
|*               Series 200 Event Receiver Card
|*
|*--------------------------------------------------------------------------------------------------
|* Authors:  John Winans (APS)
|*           Timo Korhonen (PSI)
|*           Babak Kalantari (PSI)
|*           Eric Bjorklund (LANSCE)
|*           Dayle Kotturi (SLAC) 
|*
|* Date:     2 February 2006
|*
|*--------------------------------------------------------------------------------------------------
|* MODIFICATION HISTORY:
|* 21 Jul 1993  J.Winans        Original APS Event system device support module.
|*
|* 04 Feb 2006  D.Kotturi.      Split driver and device support into separate software modules.
|*              T.Korhonen      Make code OS-independent for EPICS Release 3.14.
|*                              Add support for data stream
|*
|* 30 Mar 2006  D.Kotturi       Change from array of EgLinkStructs to linked 
|*                              list of EgCardStructs
|*
|*--------------------------------------------------------------------------------------------------
|* MODULE DESCRIPTION:
|*
|* This module contains the EPICS driver-support code for the Micro-Research Finland series 200
|* event generator card.  It is based on John Winan's original device support module for the

|**************************************************************************************************
|*
|* This software is distributed under the EPICS Open License Agreement which
|* can be found in the file, LICENSE, included in this directory.
|*
\*************************************************************************************************/

/**************************************************************************************************/
/*  If EVR_DEBUG Flag is Defined, Make All Local Routines Globally Callable                       */
/**************************************************************************************************/

/* NOT REACHING drvMrfEg.h FOR SOME REASON
#define EVG_DRIVER_SUPPORT_MODULE   Indicates we are in the driver support module environment */

#ifdef EVG_DEBUG
#undef  LOCAL
#define LOCAL
#endif

#include <epicsEvent.h>         /* EPICS event sem                       */
#include <epicsExport.h>        /* EPICS Symbol exporting macro definitions                       */
#include <epicsStdlib.h>        /* EPICS Standard C library support routines                      */
#include <epicsStdio.h>         /* EPICS Standard C I/O support routines                          */
#include <epicsTypes.h>         /* EPICS Architecture-independent type definitions                */
#include <epicsInterrupt.h>     /* EPICS Interrupt context support routines                       */
#include <epicsMutex.h>         /* EPICS Mutex support library                                    */
#include <epicsThread.h>        /* EPICS Thread support library                                   */

#include <dbAccess.h>           /* DBE_VALUE */
#include <dbEvent.h>            /* db_post_events */
#include <devLib.h>             /* EPICS Device hardware addressing support library               */
#include <drvSup.h>             /* EPICS Driver support definitions                               */
#include <ellLib.h>             /* EPICS Linked list support library                              */
#include <errlog.h>             /* EPICS Error logging support library                            */
#include <registryFunction.h>   /* EPICS Registry support library                                 */
#include <iocsh.h>              /* EPICS iocsh support library                                    */

#include <mrfVme64x.h>          /* VME-64X CR/CSR routines and definitions (with MRF extensions)  */
#include <drvMrfEg.h>           /* MRF Event Receiver driver support layer interface              */
#include <egRecord.h>           /* For driver to load seq rams, we need to know the mode          */
#include <egeventRecord.h>      /* In order to do sth with egeventRecord */

/**************************************************************************************************/
/*  Series 200 VME Event Generator Register Map                                                   */
/**************************************************************************************************/
typedef struct MrfEVGRegs
{
  epicsUInt16 Control   ;
  epicsUInt16 EventMask ;
  epicsUInt16 VmeEvent  ;       /* and distributed bus data (byte wide) */
  epicsUInt16 obsolete_Seq2Addr  ;
  epicsUInt16 obsolete_Seq2Data  ;
  epicsUInt16 obsolete_Seq1Addr  ;
  epicsUInt16 obsolete_Seq1Data  ;

  epicsUInt16 Event0Map   ;     /**< Event Mapping Register for external (HW) input 0 */
  epicsUInt16 Event1Map   ;     /**< Event Mapping Register for external (HW) input 1 */
  epicsUInt16 Event2Map   ;     /**< Event Mapping Register for external (HW) input 2 */
  epicsUInt16 Event3Map   ;     /**< Event Mapping Register for external (HW) input 3 */
  epicsUInt16 Event4Map   ;     /**< Event Mapping Register for external (HW) input 4 */
  epicsUInt16 Event5Map   ;     /**< Event Mapping Register for external (HW) input 5 */
  epicsUInt16 Event6Map   ;     /**< Event Mapping Register for external (HW) input 6 */
  epicsUInt16 Event7Map   ;     /**< Event Mapping Register for external (HW) input 7 */

  /* Extended registers */
  epicsUInt16 MuxCountDbEvEn;   /**< Multiplexed counter distributed bus (byte wide) */
                                            /**< enables and event trigger enables (byte wide) */
  epicsUInt16 obsolete_Seq1ExtAddr  ;      /**< Extended address SEQ RAM 1 */
  epicsUInt16 obsolete_Seq2ExtAddr  ;      /**< Extended address SEQ RAM 2 */
  epicsUInt16 Seq1ClockSel  ;     /**< Sequence RAM 1 clock selection */
  epicsUInt16 Seq2ClockSel  ;     /**< Sequence RAM 2 clock selection */
  epicsUInt16 ACinputControl;     /**< AC related controls register */
  epicsUInt16 MuxCountSelect;     /**< reset, Mux seq. trigger enable and Mux select */
  epicsUInt16 MuxPrescaler;       /**< Mux prescaler values (25MHz/value) */
  epicsUInt16 FPGAVersion ;      /**< FPGA firmware register number (only series 100) */
  epicsUInt32 Reserved_0x30;
  epicsUInt32 Reserved_0x34;
  epicsUInt32 Reserved_0x38;
  epicsUInt32 Reserved_0x3C;
  epicsUInt16 RfSelect;         /* 0x40, RF Clock Selection register */
  epicsUInt16 MxcPolarity;      /* 0x42, Mpx counter reset polarity */
  epicsUInt16 Seq1Addr;         /* 0x44, 11 bit address, 0-2047 (2 kB event RAM) */
  epicsUInt16 Seq1Data;         /* 0x46, Event code, 8 bits */
  epicsUInt32 Seq1Time;         /* 0x48, Time offset in event clock from trigger */
  epicsUInt32 Seq1Pos;          /* 0x52, Current sequence time position */
  epicsUInt16 Seq2Addr;         /* 0x56, 11 bit address, 0-2047 */
  epicsUInt16 Seq2Data;         /* 0x58,  Event code, 8 bits */
  epicsUInt32 Seq2Time;         /**< Time offset in event clock from trigger */
  epicsUInt32 Seq2Pos;          /**< Current sequence time position */
  epicsUInt16 EvanControl;      /**< Event analyser control register */
  epicsUInt16 EvanEvent;        /**< Event analyser event code, 8 bits */
  epicsUInt32 EvanTimeH;        /**< Bits 63-32 of event analyser time counter */
  epicsUInt32 EvanTimeL;        /**< Bits 31-0 of event analyser time counter */
  epicsUInt16 uSecDiv;          /* 0x68, Divider to get from event clock to ~1 MHz */
  epicsUInt16 DataBufControl;  /* 0x6A, Data Buffer control register */
  epicsUInt16 DataBufSize;    /* 0x6C, Data Buffer transfer size in bytes,
                            multiple of four */
  epicsUInt16 DBusEvents;  /* 0x6E, Distributed bus events enable, these are for
                         special event codes:
                         DBUS7: event code 0x7D, reset prescaler/load seconds
                         DBUS6: event code 0x71, seconds '1'
                         DBUS5: event code 0x70, seconds '0' */
  epicsUInt32 Reserved_0x70;
  epicsUInt32 Reserved_0x74;
  epicsUInt32 Reserved_0x78;
  epicsUInt32 Reserved_0x7C;
  epicsUInt32 FracDivControl;   /* 0x80, Micrel SY87739L programming word */
  epicsUInt32 DelayRf;          /* 0x84 */
  epicsUInt32 DelayRx;          /* 0x88 */
  epicsUInt32 DelayTx;          /* 0x8C */
  epicsUInt32 AdiControl;       /* 0x90 */              
  epicsUInt32 FbTxFrac;         /* 0x94 */
  epicsUInt32 DelayRFInit;      /* 0x98, Init value for RF Delay Chip */
  epicsUInt32 DelayRxInit;      /* 0x9C, Init value for Rx Delay Chip */
  epicsUInt32 DelayTxInit;      /* 0xA0, Init value for Tx Delay Chip */
  epicsUInt32 Reserved_0xA4;
  epicsUInt32 Reserved_0xA8;
  epicsUInt32 Reserved_0xAC;
  epicsUInt32 Reserved_0xB0;
  epicsUInt32 Reserved_0xB4;
  epicsUInt32 Reserved_0xB8;
  epicsUInt32 Reserved_0xBC;
  epicsUInt32 Reserved_0xC0;
  epicsUInt32 Reserved_0xC4;
  epicsUInt32 Reserved_0xC8;
  epicsUInt32 Reserved_0xCC;
  epicsUInt32 Reserved_0xD0;
  epicsUInt32 Reserved_0xD4;
  epicsUInt32 Reserved_0xD8;
  epicsUInt32 Reserved_0xDC;
  epicsUInt32 Reserved_0xE0;
  epicsUInt32 Reserved_0xE4;
  epicsUInt32 Reserved_0xE8;
  epicsUInt32 Reserved_0xEC;
  epicsUInt32 Reserved_0xF0;
  epicsUInt32 Reserved_0xF4;
  epicsUInt32 Reserved_0xF8;
  epicsUInt32 Reserved_0xFC;
  epicsUInt32 Reserved_0x100[0x700/4];
  epicsUInt32 DataBuffer[EVG_MAX_DATA_ARRAY_SIZE];
}MrfEVGRegs;

#define EG_MONITOR                      /* Include the EG monitor program */
#define RAM_LOAD_SPIN_DELAY     1       /* taskDelay() for waiting on RAM */
